perf/ARS-volume.yaml
# perf/ars-volume.basic.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"   
          port: 8125
          prefix: "artillery-api"

  pool: 20

  phases:
    - name: Warmup
      duration: 60
      arrivalRate: 10
    - name: Moderate
      duration: 90
      arrivalRate: 50
    - name: Peak
      duration: 60
      arrivalRate: 150
    - name: Cooldown
      duration: 60
      arrivalRate: 20

scenarios:
  - name: Exchange USD->ARS
    weight: 70
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 50  
          expect:
            - statusCode: 200

  - name: Exchange ARS->USD
    weight: 30
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 5000      # Genera volumen desde el lado ARS base
          expect:
            - statusCode: 200