perf/EUR-volume.yaml
# perf/eur-volume.basic.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"   
          port: 8125
          prefix: "artillery-api"

  pool: 20

  phases:
    - name: Warmup
      duration: 60
      arrivalRate: 10
    - name: Moderate
      duration: 90
      arrivalRate: 50
    - name: Peak
      duration: 60
      arrivalRate: 150
    - name: Cooldown
      duration: 60
      arrivalRate: 20

scenarios:
  - name: Exchange ARS->EUR
    weight: 70
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "EUR"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 2000   
          expect:
            - statusCode: 200

  - name: Exchange EUR->ARS
    weight: 30
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 10      # Genera volumen desde el lado EUR base
          expect:
            - statusCode: 200