perf/dashboard-tester.yaml
# perf/dashboard-tester.yaml - Test rápido de todas las monedas
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"   
          port: 8125
          prefix: "artillery-api"

  pool: 10

  phases:
    - name: QuickTest
      duration: 60
      arrivalRate: 5

scenarios:
  - name: USD Operations
    weight: 25
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 1000
          expect:
            - statusCode: 200

  - name: EUR Operations
    weight: 25
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "EUR"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 2000
          expect:
            - statusCode: 200

  - name: ARS Operations
    weight: 25
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 10
          expect:
            - statusCode: 200

  - name: BRL Operations
    weight: 25
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "BRL"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 5000
          expect:
            - statusCode: 200