perf/spike.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "artillery-api"

  # Reutiliza conexiones TCP del host (Artillery corre fuera de Docker)
  pool: 50

  phases:
    - name: Warmup
      duration: 90         # ~1.5 min
      arrivalRate: 20      # 20 req/s
    - name: Spike
      duration: 150        # ~2.5 min
      arrivalRate: 160     # salto brusco al pico
    - name: Cooldown
      duration: 90
      arrivalRate: 20

scenarios:
  # 80% de las requests simulan la “corrida” (ARS→USD)
  - name: Exchange (ARS->USD)
    weight: 80
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1        # cuenta interna ARS
            counterAccountId: 2     # cuenta interna USD
            baseAmount: 100000      # monto en ARS

  # 15% refrescan cotizaciones
  - name: Rates
    weight: 15
    flow:
      - get:
          url: "/rates"

  # 5% consultan operaciones recientes
  - name: Log
    weight: 5
    flow:
      - get:
          url: "/log"